Artillery_files/listLoopTest.yml
config:
  target: 'http://ec2-18-220-221-154.us-east-2.compute.amazonaws.com:3000'
  phases:
    - duration: 60
      arrivalRate: 10
  variables:
    productIds:
      - [2999900, 2999901, 2999902, 2999903, 2999904, 2999905, 2999906, 2999907, 2999908, 2999909, 2999910, 2999911, 2999912, 2999913, 2999914, 2999915, 2999916, 2999917, 2999918, 2999919, 2999920, 2999921, 2999922, 2999923, 2999924, 2999925, 2999926, 2999927, 2999928, 2999929, 2999930, 2999931, 2999932, 2999933, 2999934, 2999935, 2999936, 2999937, 2999938, 2999939, 2999940, 2999941, 2999942, 2999943, 2999944, 2999945, 2999946, 2999947, 2999948, 2999949, 2999950, 2999951, 2999952, 2999953, 2999954, 2999955, 2999956, 2999957, 2999958, 2999959, 2999960, 2999961, 2999962, 2999963, 2999964, 2999965, 2999966, 2999967, 2999968, 2999969, 2999970, 2999971, 2999972, 2999973, 2999974, 2999975, 2999976, 2999977, 2999978, 2999979, 2999980, 2999981, 2999982, 2999983, 2999984, 2999985, 2999986, 2999987, 2999988, 2999989, 2999990, 2999991, 2999992, 2999993, 2999994, 2999995, 2999996, 2999997, 2999998, 2999999]
scenarios:
  - flow:
      - loop:
          - get:
              url: "/reviews/{{ $loopElement }}/list"
        over: productIds